# Data Cleaning Pandas(Asiignment 6)

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
df[df["FlightNumber"].isnull()]

          From_To  FlightNumber RecentDelays            Airline
1    MAdrid_miLAN           NaN           []  <Air France> (12)
3  Budapest_PaRis           NaN         [13]     12. Air France

In [28]:
l=df.index[df['FlightNumber'].isnull()].tolist()

## Q1

In [32]:
for i in l:
    df.loc[i,"FlightNumber"]=df.loc[i-1,"FlightNumber"]+10

In [35]:
df["FlightNumber"]=df["FlightNumber"].astype("int64")

In [36]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## Q2

In [74]:
df["From"]=df["From_To"].str.split("_")
f=[]
t=[]
for i in df["From"]:
    f.append(i[0])
    t.append(i[1])
    
df["From"]=f
df["To"]=t

## Q3

In [78]:
df["From"]=df["From"].str.capitalize()
df["To"]=df["To"].str.capitalize()

## Q4

In [80]:
df.drop("From_To",axis=1,inplace=True)

In [81]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Q5

In [83]:
temp=df["RecentDelays"]
temp

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [84]:
type(temp)

pandas.core.series.Series

In [85]:
delays = df['RecentDelays'].apply(pd.Series)

In [89]:
(delays)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [87]:

temp

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [90]:
delays.columns = ['delay_{}'.format(n)
 for n in range(1, len(delays.columns)+1)]
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [91]:
df = df.drop('RecentDelays', axis=1).join(delays)

In [92]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN